_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СтроительныеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УСОERP_СценарииПланированияПроектовСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDProject</Name>
					<Comment>Служебный реквизит, предназначен для хранения UID, загруженных из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Веха</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровнеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредшественники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаОграничения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРесурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагрузкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конструктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конструктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ТипыЗависимостейРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ТипыЗависимостейРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОкончание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ТипыОграничений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ТипыОграничений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакМожноРаньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакМожноПозже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы/Forms/ФормаЭлементаДинамическая/Ext/Form/Module.bsl
&НаСервере
Перем ТаблицаГрафика;
&НаКлиенте
Перем КэшированныеЗначения;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектСтроительства = Объект.Владелец.Владелец;
	
		// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  		
		 		
		Если Параметры.Свойство("Владелец") Тогда
			
			Объект.Владелец = Параметры.Владелец;
			
		КонецЕсли;		
		
		Объект.ЕдиницаДлительности = Объект.Владелец.Владелец.ЕдиницаДлительности;
		Объект.ЕдиницаЗадержки     = Объект.Владелец.Владелец.ЕдиницаДлительности;
		Объект.ГрафикРаботы = Объект.Владелец.Владелец.ГрафикРаботы;
		Объект.Длительность = 1;
		Объект.НомерРаботыВУровне = 0;
		ЭтоНовыйОбъект = Истина;
		
		Если Параметры.Свойство("Родитель") Тогда
			
			Объект.Родитель = Параметры.Родитель;
			Объект.Задержка = Объект.Родитель.Задержка;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Предшественник") И ЗначениеЗаполнено(Параметры.Предшественник) Тогда
			
			Нстр = Объект.Предшественники.Добавить();
			Нстр.СтроительнаяРабота = Параметры.Предшественник;
			Нстр.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало;
			Нстр.Задержка = 0;
			Нстр.ЕдиницаЗадержки = Перечисления.ЕдиницыИзмеренияВремени.День;
			
		КонецЕсли;
				
		Если Параметры.Свойство("Переносить")  Тогда
			
			Переносить = Истина;		
			
			Если Параметры.Переносить = Истина  Тогда
				
				Объект.Материалы.Загрузить(Объект.Родитель.Материалы.Выгрузить());
				Объект.Ресурсы.Загрузить(Объект.Родитель.Ресурсы.Выгрузить());
				Объект.Предшественники.Загрузить(Объект.Родитель.Предшественники.Выгрузить());
				Объект.Длительность = Объект.Родитель.Длительность;
				Объект.ЕдиницаДлительности = Объект.Родитель.ЕдиницаДлительности;
				Объект.ОбъемРаботы = Объект.Родитель.ОбъемРаботы;
				Объект.ЕдиницаОбъема = Объект.Родитель.ЕдиницаОбъема;
				Объект.НомерРаботыВУровне = 1;
				
				Объект.ГрафикРаботы = ?(ЗначениеЗаполнено(Объект.Родитель.ГрафикРаботы),Объект.Родитель.ГрафикРаботы,Объект.Владелец.Владелец.ГрафикРаботы);
				
			КонецЕсли;
			
		КонецЕсли; 		
		
		Если Параметры.Свойство("НомерРаботыВУровне") Тогда
			
			Объект.НомерРаботыВУровне = Параметры.НомерРаботыВУровне;
			
		КонецЕсли;
		
	КонецЕсли;   
	
	Если Параметры.Свойство("УИДГрафика") Тогда
		
		УИДГрафика = Параметры.УИДГрафика;
		
	КонецЕсли;
	
	ЭтоГруппаРабот = Объект.СуммарнаяРабота;	
	
	Если НЕ Объект.Владелец.НомерВерсии Тогда
		
		ЗаполнитьТаблицуГрафика();
	
	Если НЕ ТабГрафик.Количество() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен график!");
		Отказ = Истина;
	КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьДаты();
	ЗаполнитьКодСДР();
	РассчитатьТрудоМашиноемкость();
	ВыполненныйОбъем = Справочники.УСОERP_СтроительныеРаботы.ПолучитьВыполненныйОбъем(Объект.Ссылка);
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьРесурсыМатериалыГруппыРабот();
	
	ЭтаФорма.ТолькоПросмотр = Объект.Владелец.НомерВерсии;
	
	НоменклатураСервер.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Материалы); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.Материалы,
	Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()  	
		
	Элемент = УсловноеОформление.Элементы.Добавить();  	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.НачалоНеРанее;  	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1);	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.НачалоНеПозднее;	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1); 	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина); 	
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.ОкончаниеНеРанее;	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1); 	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.ОкончаниеНеПозднее;	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1); 	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.ФиксированноеНачало;	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1); 	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТипОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Перечисления.УСОERP_ТипыОграничений.ФиксированноеОкончание;	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Дата(1,1,1); 	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаОграничения");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОграничения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЕдиницаДлительности");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЕдиницаДлительности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Длительность");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Ложь;	
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Длительность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  0;	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЕдиницаДлительности");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение =  Ложь;	
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЕдиницаДлительности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);  	
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,"МатериалыХарактеристика", "Объект.Материалы.ХарактеристикиИспользуются");
    НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма,"МатериалыЕдиницаИзмерения", "Объект.Материалы.Упаковка"); 
	
	Элементы.РесурсыТрудоемкость.Видимость = Объект.Владелец.НомерВерсии;
	Элементы.РесурсыМашиноемкость.Видимость = Объект.Владелец.НомерВерсии;
	Элементы.РесурсыТрудоемкостьРасчетная.Видимость = НЕ Объект.Владелец.НомерВерсии;
	Элементы.РесурсыМашиноемкостьРасчетная.Видимость = НЕ Объект.Владелец.НомерВерсии;		
	Элементы.ГруппаРаспределение.Видимость = Объект.Владелец.НомерВерсии И Объект.Распределение.Количество() И НЕ Объект.СуммарнаяРабота;
	Элементы.РаспределениеКоличество.Заголовок = "Объем ("+Объект.ЕдиницаОбъема+")";
	Элементы.ГруппаРаспределение.Заголовок = "Распределение по датам ("+Объект.Распределение.Количество()+")";

КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьКодСДР()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Владелец.НомерВерсии ТОгда
		КодСДР = Объект.КодСДР;
		Возврат;
	КонецЕсли;
	
	КодСДР = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДР(Объект.Ссылка);
	 		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЕстьПредшественник = Объект.Предшественники.Количество();  	
		
	Элементы.ДатаНачала.Доступность    = НЕ ЕстьПредшественник;
	Элементы.ДатаОкончания.Доступность = НЕ ЕстьПредшественник;
	Элементы.ТипОграничения.Видимость  = ЕстьПредшественник;
	Элементы.ДатаОграничения.Видимость = ЕстьПредшественник;  	
	Элементы.ГруппаОбъем.Видимость = НЕ ЭтоГруппаРабот;
	
	Элементы.ГруппаПредшественники.Заголовок = "Предшественники ("+Объект.Предшественники.Количество()+")";
	Элементы.ГруппаМатериалы.Заголовок = "Материалы ("+Объект.Материалы.Количество()+")";
	Элементы.ГруппаРесурсы.Заголовок = "Ресурсы ("+Объект.Ресурсы.Количество()+")"; 	
	Элементы.ГруппаМатериалыГруппы.Заголовок = "Материалы ("+ТабМатериалы.Количество()+")";
	Элементы.ГруппаРесурсыГруппы.Заголовок = "Ресурсы ("+ТабРесурсы.Количество()+")";	
	
	Если Объект.СуммарнаяРабота Тогда
		
		Элементы.ГруппаДаты.ТолькоПросмотр = Истина;
		Элементы.ДатаНачала.ТолькоПросмотр = Истина;
		Элементы.ДатаОкончания.ТолькоПросмотр = Истина;
		Элементы.ЕдиницаДлительности.ТолькоПросмотр = Истина;
		Элементы.Материалы.ТолькоПросмотр = Истина;
		Элементы.Ресурсы.ТолькоПросмотр = Истина;		
		
	КонецЕсли;
	
	Элементы.Длительность.Видимость = НЕ ЭтоГруппаРабот;
	Элементы.ДлительностьГруппы.Видимость = ЭтоГруппаРабот;
	Элементы.ГрафикРаботы.Видимость = НЕ ЭтоГруппаРабот; 	
	Элементы.ОбъемРаботы.Видимость = НЕ ЭтоГруппаРабот;
	Элементы.ЕдиницаОбъема.Видимость = НЕ ЭтоГруппаРабот;	
	Элементы.ГруппаМатериалы.Видимость = НЕ ЭтоГруппаРабот;
	Элементы.ГруппаРесурсы.Видимость = НЕ ЭтоГруппаРабот;
	Элементы.ГруппаПредшественники.Видимость = НЕ ЭтоГруппаРабот;
	Элементы.ГруппаМатериалыГруппы.Видимость = ЭтоГруппаРабот;
	Элементы.ГруппаРесурсыГруппы.Видимость = ЭтоГруппаРабот;
	
	Если ВыполненныйОбъем Тогда
		Элементы.ЕдиницаОбъема.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
		
	СтрокаДаты = ПолучитьСтрокуГрафика(ДатаНачала);
	
	Если НачалоДня(ДатаНачала) = СтрокаДаты.ДатаГрафика Тогда
		ДатаНачала = Мин(ДатаНачала,СтрокаДаты.ДатаОкончания);
		ДатаНачала = Макс(ДатаНачала,СтрокаДаты.ДатаНачала);
	Иначе
		ДатаНачала = СтрокаДаты.ДатаНачала;
	КонецЕсли;
	
	СтрокаГрафика = ПолучитьСтрокуГрафика(ДатаНачала);
	
	Разница = 0;
	
	Если СтрокаГрафика.ЕстьПерерывы Тогда
		
		Т_Пер  = ТабПерерывы.НайтиСтроки(Новый Структура("ГрафикРаботы,НомерДня",Объект.ГрафикРаботы,СтрокаГрафика.НомерДня)).Получить(0).ТабПерерывов;
		
		ВремяНачала = Дата(1,1,1)+(ДатаНачала - НачалоДня(ДатаНачала));
		
		Для Каждого СтрокаПер ИЗ Т_Пер Цикл
			
			Если ВремяНачала >= СтрокаПер.ВремяНачала И ВремяНачала < СтрокаПер.ВремяОкончания Тогда
				
				//ДатаНачала = НачалоДня(ДатаНачала)+(СтрокаПер.ВремяОкончания-Дата(1,1,1));
				
				ВремяНачала = СтрокаПер.ВремяОкончания;
				
				//Прервать;
				
			КонецЕсли;
			
			Если ВремяНачала >= СтрокаПер.ВремяОкончания Тогда
				
				Разница = Разница+СтрокаПер.Длительность;
				
			КонецЕсли;
			
			
		КонецЦикла;  		
		
	ДатаНачала = НачалоДня(ДатаНачала)+(ВремяНачала-Дата(1,1,1));

КонецЕсли;


ЗадержкаРаботы = (ДатаНачала-СтрокаДаты.ДатаНачала)-Разница;

Объект.Задержка = СтрокаДаты.Задержка+ЗадержкаРаботы/СтрокаДаты.ДлительностьДня;
	
	//Разница = 0;
	//
	//Если СтрокаГрафика.ЕстьПерерывы Тогда
	//	
	//	
	//	
	//КонецЕсли;
	
	
	
	//Объект.Задержка = СтрокаДаты.Задержка+(ДатаНачала-СтрокаДаты.ДатаНачала)*СтрокаДаты.ДлительностьДня;

  	ДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(Ложь);

	Модифицированность = Истина;
	
	РассчитатьТрудоМашиноемкость(); 
		
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеРаботы(Работа)  	
   
	Если НЕ Объект.Предшественники.Количество() Тогда 		
		
		Если Работа.Задержка = Цел(Работа.Задержка) И Работа.Длительность = Цел(Работа.Длительность) И Работа.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
			
			СтрокиНачала = 	ТабГрафик.НайтиСтроки(Новый Структура("Задержка,ГрафикРаботы",Цел(Работа.Задержка),Работа.ГрафикРаботы));
			
			Если СтрокиНачала.Количество() Тогда 
				
				ТекДатаНачала = СтрокиНачала.Получить(0).ВремяНачала;
				ТекДатаНачала = СтрокиНачала.Получить(0).ДатаНачала;
				
			Иначе
				
				ТекДатаНачала = Объект.Владелец.НачалоСтроительства;
				
			КонецЕсли;
			
			СтрокиОкончания = ТабГрафик.НайтиСтроки(Новый Структура("ГрафикРаботы,Задержка",Работа.ГрафикРаботы,Работа.Задержка+Работа.Длительность-1));
			
			Если СтрокиОкончания.Количество() Тогда
				
				ТекДатаОкончания = СтрокиОкончания.Получить(0).ВремяОкончания;
				ТекДатаОкончания = СтрокиОкончания.Получить(0).ДатаОкончания;
				
			КонецЕсли; 			
			
			Возврат Новый Структура("ДатаНачала,ДатаОкончания,ДлительностьГруппы",ТекДатаНачала,ТекДатаОкончания,0); 
			
		КонецЕсли;
		            	
		ЦелЗадержка = Цел(Работа.Задержка);
		
		ТекСтрокаГрафика = ТабГрафик.НайтиСтроки(Новый Структура("Задержка,ГрафикРаботы",ЦелЗадержка,Работа.ГрафикРаботы)).Получить(0);
		
		ДатаБезМинут = ТабГрафик.НайтиСтроки(Новый Структура("Задержка,ГрафикРаботы",ЦелЗадержка,Работа.ГрафикРаботы)).Получить(0).ДатаНачала;
		ДлительностьДня = ТабГрафик.НайтиСтроки(Новый Структура("Задержка,ГрафикРаботы",ЦелЗадержка,Работа.ГрафикРаботы)).Получить(0).ДлительностьДня;
		СекундыДаты = (Работа.Задержка-ЦелЗадержка)*ДлительностьДня;
		ТекДатаНачала = ДатаБезМинут+СекундыДаты;
		
		Если Объект.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
			
			ДобавляемаяЗадержка = ?(Работа.Задержка-Цел(Работа.Задержка)+Работа.Длительность-Цел(Работа.Длительность)<=1,1,2);
			
			ДобавляемаяЗадержкаОкончание = Работа.Задержка-Цел(Работа.Задержка)+Работа.Длительность-Цел(Работа.Длительность)-ЦЕЛ(Работа.Задержка-Цел(Работа.Задержка)+Работа.Длительность-Цел(Работа.Длительность));
			
			ДатаОкончанияБезМинут = ТабГрафик.НайтиСтроки(Новый Структура("ГрафикРаботы,Задержка",Работа.ГрафикРаботы,Цел(Работа.Задержка)+Цел(Работа.Длительность)-1+ДобавляемаяЗадержка)).Получить(0).ДатаНачала;
			ДлительностьДня = ТабГрафик.НайтиСтроки(Новый Структура("ГрафикРаботы,Задержка",Работа.ГрафикРаботы,Цел(Работа.Задержка)+Цел(Работа.Длительность)-1+ДобавляемаяЗадержка)).Получить(0).ДлительностьДня;
			
			ТекДатаОкончания = ДатаОкончанияБезМинут+ДлительностьДня*ДобавляемаяЗадержкаОкончание;
			
		ИначеЕсли Объект.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
			
		НадоДобавить = Объект.Длительность*3600;
		
		ТекЗадержка = ТекСтрокаГрафика.Задержка;
		ТекДатаОкончания = ТекДатаНачала;
				
		Пока Истина Цикл
			
			Если НадоДобавить = 0 Тогда
				Прервать;
			КонецЕсли;
			
			МожноДобавить = МИН(НадоДобавить,ТекСтрокаГрафика.ДатаОкончания - ТекДатаОкончания);
			
			ТекДатаОкончания = ТекДатаОкончания+МожноДобавить;
			
			НадоДобавить = НадоДобавить-МожноДобавить;
			
			Если НадоДобавить Тогда
				
				ТекЗадержка = ТекЗадержка+1;
				ТекСтрокаГрафика = ТабГрафик.НайтиСтроки(Новый Структура("Задержка,ГрафикРаботы",ТекЗадержка,Работа.ГрафикРаботы)).Получить(0);
				ТекДатаОкончания = ТекСтрокаГрафика.ДатаНачала;
				
			КонецЕсли;
						
		КонецЦикла;
		
		ДатаОкончания = ТекДатаОкончания; 	  	 
			
		КонецЕсли;     		
			
	КонецЕсли;
	
	Возврат Новый Структура("ДатаНачала,ДатаОкончания,ДлительностьГруппы",ТекДатаНачала,ТекДатаОкончания,0);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРесурсыМатериалыГруппыРабот()
	
	Если НЕ ЭтоГруппаРабот Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГруппаРабот",Объект.Ссылка);
	КоэффициентПакета = 0;
	
	Если НЕ ПустаяСтрока(УидГрафика) Тогда
		
		ТЗ = ПолучитьИзВременногоХранилища(УидГрафика);
		Запрос.УстановитьПараметр("ТЗ",ТЗ);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
		|	ТЗ.ДлительностьВЧасах КАК ДлительностьВЧасах
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ресурс КАК Ресурс,
		|	СУММА(ВложенныйЗапрос.КоличествоРабочих) КАК КоличествоРабочих,
		|	СУММА(ВложенныйЗапрос.КоличествоМеханизмов) КАК КоличествоМеханизмов
		|ПОМЕСТИТЬ ВрТабРесурсы
		|ИЗ
		|	(ВЫБРАТЬ
		|		УСОERP_РесурсыРабочие.Ссылка КАК Ресурс,
		|		МАКСИМУМ(УСОERP_РесурсыРабочие.НомерСтроки) КАК КоличествоРабочих,
		|		СУММА(0) КАК КоличествоМеханизмов
		|	ИЗ
		|		Справочник.УСОERP_Ресурсы.Рабочие КАК УСОERP_РесурсыРабочие
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УСОERP_РесурсыРабочие.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УСОERP_РесурсыМеханизмы.Ссылка,
		|		СУММА(0),
		|		МАКСИМУМ(УСОERP_РесурсыМеханизмы.НомерСтроки)
		|	ИЗ
		|		Справочник.УСОERP_Ресурсы.Механизмы КАК УСОERP_РесурсыМеханизмы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УСОERP_РесурсыМеханизмы.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ресурс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Работа КАК Работа,
		|	ВрТаб.ДлительностьВЧасах КАК ДлительностьВЧасах,
		|	УСОERP_СтроительныеРаботыРесурсы.Ресурс КАК Ресурс,
		|	УСОERP_СтроительныеРаботыРесурсы.Количество КАК Количество,
		|	УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент КАК ЗагрузкаПроцент,
		|	УСОERP_СтроительныеРаботыРесурсы.ГрафикРаботы КАК ГрафикРаботы,
		|	ВрТаб.ДлительностьВЧасах * УСОERP_СтроительныеРаботыРесурсы.Количество * ВрТабРесурсы.КоличествоРабочих * УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент / 100 КАК Трудоемкость,
		|	ВрТаб.ДлительностьВЧасах * УСОERP_СтроительныеРаботыРесурсы.Количество * ВрТабРесурсы.КоличествоМеханизмов * УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент / 100 КАК Машиноемкость
		|ПОМЕСТИТЬ ВрТабРезультат
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы.Ресурсы КАК УСОERP_СтроительныеРаботыРесурсы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабРесурсы КАК ВрТабРесурсы
		|			ПО УСОERP_СтроительныеРаботыРесурсы.Ресурс = ВрТабРесурсы.Ресурс
		|		ПО ВрТаб.Работа = УСОERP_СтроительныеРаботыРесурсы.Ссылка
		|ГДЕ
		|	ВрТаб.Работа В ИЕРАРХИИ(&ГруппаРабот)
		|	И НЕ ВрТаб.Работа.СуммарнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТабРезультат.Ресурс КАК Ресурс,
		|	СУММА(ВрТабРезультат.Количество) КАК Количество,
		|	ВрТабРезультат.ЗагрузкаПроцент КАК ЗагрузкаПроцент,
		|	ВрТабРезультат.ГрафикРаботы КАК ГрафикРаботы,
		|	СУММА(ВрТабРезультат.Трудоемкость) КАК Трудоемкость,
		|	СУММА(ВрТабРезультат.Машиноемкость) КАК Машиноемкость
		|ИЗ
		|	ВрТабРезультат КАК ВрТабРезультат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТабРезультат.Ресурс,
		|	ВрТабРезультат.ЗагрузкаПроцент,
		|	ВрТабРезультат.ГрафикРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботыМатериалы.Номенклатура КАК Номенклатура,
		|	УСОERP_СтроительныеРаботыМатериалы.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА УСОERP_СтроительныеРаботыМатериалы.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА УСОERP_СтроительныеРаботыМатериалы.КоличествоНаЕдиницуОбъема
		|			ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаЕдиницуОбъема
		|		КОНЕЦ) КАК КоличествоНаЕдиницу,
		|	СУММА(ВЫБОР
		|			КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА УСОERP_СтроительныеРаботыМатериалы.КоличествоНаОбъемРаботы
		|			ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаОбъемРаботы
		|		КОНЕЦ) КАК Количество
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Материалы КАК УСОERP_СтроительныеРаботыМатериалы
		|ГДЕ
		|	УСОERP_СтроительныеРаботыМатериалы.Ссылка В ИЕРАРХИИ(&ГруппаРабот)
		|	И УСОERP_СтроительныеРаботыМатериалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ УСОERP_СтроительныеРаботыМатериалы.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_СтроительныеРаботыМатериалы.Номенклатура,
		|	УСОERP_СтроительныеРаботыМатериалы.Характеристика,
		|	ВЫБОР
		|		КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА УСОERP_СтроительныеРаботыМатериалы.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.Упаковка
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка";
		
		КоэффициентПакета = 3;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботыРесурсы.Ресурс,
		|	СУММА(УСОERP_СтроительныеРаботыРесурсы.Количество) КАК Количество,
		|	СРЕДНЕЕ(УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент) КАК ЗагрузкаПроцент,
		|	УСОERP_СтроительныеРаботыРесурсы.ГрафикРаботы,
		|	СУММА(УСОERP_СтроительныеРаботыРесурсы.Трудоемкость) КАК Трудоемкость,
		|	СУММА(УСОERP_СтроительныеРаботыРесурсы.Машиноемкость) КАК Машиноемкость
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Ресурсы КАК УСОERP_СтроительныеРаботыРесурсы
		|ГДЕ
		|	УСОERP_СтроительныеРаботыРесурсы.Ссылка В ИЕРАРХИИ(&ГруппаРабот)
		|	И НЕ УСОERP_СтроительныеРаботыРесурсы.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_СтроительныеРаботыРесурсы.Ресурс,
		|	УСОERP_СтроительныеРаботыРесурсы.ГрафикРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботыМатериалы.Номенклатура КАК Номенклатура,
		|	УСОERP_СтроительныеРаботыМатериалы.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА УСОERP_СтроительныеРаботыМатериалы.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА УСОERP_СтроительныеРаботыМатериалы.КоличествоНаЕдиницуОбъема
		|			ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаЕдиницуОбъема
		|		КОНЕЦ) КАК КоличествоНаЕдиницу,
		|	СУММА(ВЫБОР
		|			КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА УСОERP_СтроительныеРаботыМатериалы.КоличествоНаОбъемРаботы
		|			ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаОбъемРаботы
		|		КОНЕЦ) КАК Количество
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Материалы КАК УСОERP_СтроительныеРаботыМатериалы
		|ГДЕ
		|	УСОERP_СтроительныеРаботыМатериалы.Ссылка В ИЕРАРХИИ(&ГруппаРабот)
		|	И УСОERP_СтроительныеРаботыМатериалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ УСОERP_СтроительныеРаботыМатериалы.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_СтроительныеРаботыМатериалы.Номенклатура,
		|	УСОERP_СтроительныеРаботыМатериалы.Характеристика,
		|	ВЫБОР
		|		КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА УСОERP_СтроительныеРаботыМатериалы.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.Упаковка
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка";
		
	КонецЕсли;
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТабМатериалы.Очистить();
	ТабРесурсы.Очистить();
	
	Выборка = ПакетЗапросов[КоэффициентПакета].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТабРесурсы.Добавить(),Выборка);
	КонецЦикла;
	
	Выборка = ПакетЗапросов[КоэффициентПакета+1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТабМатериалы.Добавить(),Выборка);
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаты()
	
	Если Объект.Владелец.НомерВерсии Тогда
		
		ДатаНачала = Объект.ДатаНачала;
		ДатаОкончания = Объект.ДатаОкончания;
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.Свойство("УИДГрафика") Тогда	
		
		ТаблицаПроекта = ПолучитьИзВременногоХранилища(Параметры.УИДГрафика);
		СтрокаДат = ТаблицаПроекта.Найти(Объект.Ссылка,"Работа");
		
		ДатаНачала = СтрокаДат.ДатаНачала;
		ДатаОкончания = СтрокаДат.ДатаОкончания;
		ДлительностьГруппы = СтрокаДат.Длительность; 
			
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура РассчитатьТрудоМашиноемкость()
	
	Если Объект.СуммарнаяРабота Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Владелец.НомерВерсии Тогда //при создании копии все уже посчитано
		Возврат;
	КонецЕсли;
			
	ДлительностьОбъекта =  Объект.Длительность;
	
	Если Объект.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		
		ДлительностьОбъекта = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Объект, 
		ДатаНачала, 
		ДатаОкончания, 
		Перечисления.ЕдиницыИзмеренияВремени.Час,Объект.ГрафикРаботы);
		
		ДлительностьОбъекта = ПолучитьДлительностьРаботыВЧасах(ДатаНачала,ДатаОкончания);
		
	КонецЕсли; 
	
	Для Каждого СтрокаТЗ ИЗ Объект.Ресурсы Цикл
		
		СтруктураРесурса = ПолучитьСтруктуруРесурса(СтрокаТЗ.Ресурс);	
		
		СтрокаТЗ.ТрудоемкостьРасчетная = ДлительностьОбъекта*СтруктураРесурса.Рабочие*СтрокаТЗ.Количество*СтрокаТЗ.ЗагрузкаПроцент/100;
		СтрокаТЗ.МашиноемкостьРасчетная = ДлительностьОбъекта*СтруктураРесурса.Механизмы*СтрокаТЗ.Количество*СтрокаТЗ.ЗагрузкаПроцент/100; 		
		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьДлительностьРаботыВЧасах(ДатаНачала,ДатаОкончания)  
	
	ДопСекунда = 0;  //на случай, когда график заканчивается в 23:59:00
	
	Если НачалоДня(ДатаНачала) = ДатаНачала И КонецДня(ДатаОкончания)-59 = ДатаОкончания Тогда
		ДопСекунда = 60;
	КонецЕсли; 	
		
	Если НачалоДня(ДатаНачала) = НачалоДня(ДатаОкончания) Тогда
		Возврат (ДатаОкончания+ДопСекунда - ДатаНачала)/3600;
	КонецЕсли;
	
	СтрокаНачала = ПолучитьСтрокуГрафика(ДатаНачала);
	СтрокаОкончания = ПолучитьСтрокуГрафика(ДатаОкончания); 
	
   Запрос = Новый Запрос;
   
   Запрос.УстановитьПараметр("ТабГрафиков",РеквизитФормыВЗначение("ТабГрафик"));
   Запрос.УстановитьПараметр("ГрафикРаботы",Объект.ГрафикРаботы);
   Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
   Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
   
   Запрос.Текст =
   "ВЫБРАТЬ
   |	ВрТаб.ГрафикРаботы,
   |	ВрТаб.ДатаГрафика,
   |	ВрТаб.ДеньВключенВГрафик,
   |	ВрТаб.ДлительностьДняРасчетная,
   |	ВрТаб.ДатаНачала,
   |	ВрТаб.ДатаОкончания
   |ПОМЕСТИТЬ ВрТабГрафика
   |ИЗ
   |	&ТабГрафиков КАК ВрТаб
   |ГДЕ
   |	ВрТаб.ГрафикРаботы = &ГрафикРаботы
   |	И ВрТаб.ДатаГрафика >= НАЧАЛОПЕРИОДА(&ДатаНачала,ДЕНЬ)
   |	И ВрТаб.ДатаГрафика <= &ДатаОкончания
   |	И ВрТаб.ДеньВключенВГрафик = ИСТИНА
   |;
   |
   |////////////////////////////////////////////////////////////////////////////////
   |ВЫБРАТЬ
   |	ВрТабГрафика.ДатаГрафика,
   |	ВрТабГрафика.ДеньВключенВГрафик,
   |	ВрТабГрафика.ДлительностьДняРасчетная - ВЫБОР
   |		КОГДА НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) = ВрТабГрафика.ДатаГрафика
   |			ТОГДА РАЗНОСТЬДАТ(ВрТабГрафика.ДатаНачала, &ДатаНачала, СЕКУНДА)
   |		ИНАЧЕ 0
   |	КОНЕЦ - ВЫБОР
   |		КОГДА НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ) = ВрТабГрафика.ДатаГрафика
   |			ТОГДА РАЗНОСТЬДАТ(&ДатаОкончания, ВрТабГрафика.ДатаОкончания, СЕКУНДА)
   |		ИНАЧЕ 0
   |	КОНЕЦ  КАК ДлительностьДня,
   |	ВрТабГрафика.ДатаНачала,
   |	ВрТабГрафика.ДатаОкончания
   |ИЗ
   |	ВрТабГрафика КАК ВрТабГрафика";
   
  Результат =  Запрос.Выполнить().Выгрузить();
  
  Если СтрокаНачала.ЕстьПерерывы = ЛОЖЬ И СтрокаОкончания.ЕстьПерерывы = ЛОЖЬ Тогда 
  
  Возврат Результат.Итог("ДлительностьДня")/3600;	
  
  Иначе
		
		//Перерывы
		Итого = Результат.Итог("ДлительностьДня");
		
		Дополнительно = 0;
		
		ПерваяСтрока = Результат.Получить(0);
		СтрокаГрафика = ПолучитьСтрокуГрафика(ПерваяСтрока.ДатаНачала);
		
		Если СтрокаГрафика.ЕстьПерерывы Тогда
			
			Т_Пер  = ТабПерерывы.НайтиСтроки(Новый Структура("ГрафикРаботы,НомерДня",Объект.ГрафикРаботы,СтрокаГрафика.НомерДня)).Получить(0).ТабПерерывов;
			
			ВремяНачала = Дата(1,1,1)+(ДатаНачала - НачалоДня(ДатаНачала));
			
			Для Каждого СтрокаПер ИЗ Т_Пер Цикл
				
				Если ВремяНачала >=СтрокаПер.ВремяОкончания Тогда
					
					Дополнительно = Дополнительно+СтрокаПер.Длительность;
					
				КонецЕсли;
				
				
			КонецЦикла;  
			
		КонецЕсли;
		
		ПоследняяСтрока = Результат.Получить(Результат.Количество()-1);
		СтрокаГрафика = ПолучитьСтрокуГрафика(ПерваяСтрока.ДатаНачала);
		
		Если СтрокаГрафика.ЕстьПерерывы Тогда
			
			Т_Пер  = ТабПерерывы.НайтиСтроки(Новый Структура("ГрафикРаботы,НомерДня",Объект.ГрафикРаботы,СтрокаГрафика.НомерДня)).Получить(0).ТабПерерывов;
			
			ВремяОкончания = Дата(1,1,1)+(ДатаОкончания - НачалоДня(ДатаОкончания));
			
			Для Каждого СтрокаПер ИЗ Т_Пер Цикл
				
				Если ВремяОкончания <= СтрокаПер.ВремяНачала Тогда
					
					Дополнительно = Дополнительно+СтрокаПер.Длительность;
					
				КонецЕсли;				
				
			КонецЦикла;  			
			
		КонецЕсли;
		
		Возврат (Итого+Дополнительно)/3600;
		
		//Конец Перерывы

	КонецЕсли;


  Возврат 0;
  
КонецФункции  

&НаСервере
Функция ПолучитьСтруктуруРесурса(Ресурс)
	
	Возврат Новый Структура("Рабочие, Механизмы", Ресурс.Рабочие.Итог("Количество"), Ресурс.Механизмы.Итог("Количество"));
	
КонецФункции     

&НаСервере
Процедура ЗаполнитьТаблицуГрафика()
	
	МассивГрафиков = Новый Массив;
	МассивГрафиков.Добавить(Объект.ГрафикРаботы);
	
	ТаблицаГрафика = УСОERP_ЗащищенныеФункцииСервер.ПолучитьТаблицуГрафиков(Объект.Владелец,Объект.ГрафикРаботы);
	ЗначениеВРеквизитФормы(ТаблицаГрафика,"ТабГрафик");
	
	Т_Пер = УСОERP_ЗащищенныеФункцииСервер.ПолучитьТаблицуПерерывов(МассивГрафиков);
	
	ТабПерерывы.Очистить();
	
	Для Каждого СтрокаПер ИЗ Т_Пер Цикл
		
		Нстр = ТабПерерывы.Добавить();
		Нстр.ГрафикРаботы = СтрокаПер.ГрафикРаботы;
		Нстр.НомерДня = СтрокаПер.НомерДня;
		
		Для Каждого ПодСтрока ИЗ СтрокаПер.ТабПерерывов Цикл
			
			НПодСтрока = Нстр.ТабПерерывов.Добавить();
			ЗАполнитьЗначенияСвойств(НПодСтрока,ПодСтрока);
			
		КонецЦикла;
	КонецЦикла;
	
		
	//ЗначениеВРеквизитФормы(Т_Пер,"ТабПерерывы");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуГрафика(ДатаГрафика,Направление = Истина)
	
	СтруктураВозврата = Новый Структура("ДатаГрафика,Задержка,ДеньВключенВГрафик,ВремяНачала,ВремяОкончания,ГрафикРаботы,ДатаНачала,ДатаОкончания,ДлительностьДня,ДлительностьДняРасчетная,ЕстьПерерывы,НомерДня");
	
	Дата = НачалоДня(ДатаГрафика);
	
	Коэффициент = ?(Направление,1,-1);  
	
	Строки = ТабГрафик.НайтиСтроки(Новый Структура("ДатаГрафика",Дата));
	
	Если Строки.Количество() = 0  Тогда
		
		Для Сч = 1 ПО 30 Цикл
			
			Строки = ТабГрафик.НайтиСтроки(Новый Структура("ДатаГрафика",Дата+24*60*60*Сч*Коэффициент));
			
			Если Строки.Количество() Тогда
				Прервать;
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Строки.Количество() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,ТабГрафик.Получить(0));
		Возврат СтруктураВозврата;
		//Возврат ТабГрафик.Получить(0);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,Строки.Получить(0));
	
	Возврат СтруктураВозврата;
	
	Возврат Строки.Получить(0);
	
КонецФункции  

&НаКлиенте
Функция ПолучитьСтрокуГрафикаПоЗадержке(Задержка,Ошибка = Ложь)
	
	Если НЕ ТабГрафик.Количество() Тогда
		ВызватьИсключение("Не заполнен график "+Объект.ГрафикРаботы); 
	КонецЕсли;
	
	Строка = ТабГрафик.Получить(0);  
	
	Если Задержка < Строка.Задержка Тогда  //возвращаем первую строку	
		Возврат Строка;
	КонецЕсли;    	
	
	Строки = ТабГрафик.НайтиСтроки(Новый Структура("Задержка",Задержка));
	
	Если Строки.Количество() 
		Тогда
		
		Строка = СТроки.Получить(0);
		
	КонецЕсли;
	
	Возврат  Строка; 
	
КонецФункции

&НаКлиенте
Функция ПосчитатьДатуНачалаПоДатеОкончания(Направление = Истина)
	 	
	ТекДатаОкончания = ДатаОкончания;
	ТекСтрокаГрафика = ПолучитьСтрокуГрафика(ДатаОкончания,Направление);  
	
	ЗадержкаОкончанияДень = 0;
	ЗадержкаОкончанияСек = 0;
	
	Если НачалоДня(ДатаОкончания) = ТекСтрокаГрафика.ДатаГрафика Тогда		
		
		ЗадержкаОкончанияДень =  Макс(0,(ТекСтрокаГрафика.ДатаОкончания - ДатаОкончания)/ТекСтрокаГрафика.ДлительностьДня); 		
		
	Иначе  		
		
		ТекДатаНачала = ТекСтрокаГрафика.ДатаОкончания;
		
	КонецЕсли;
	
	Если Объект.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День") Тогда
		
		ОбщЗадержка = Объект.Длительность+ЗадержкаОкончанияДень;
		ЦелЗадержка = Цел(ОбщЗадержка);
		Если ЦелЗадержка = ОбщЗадержка Тогда
			ЦелЗадержка = ЦелЗадержка-1;
		КонецЕсли;
		
		ДробЗадержка = ?(ОбщЗадержка-Цел(общЗадержка) = 0,1,ОбщЗадержка-Цел(общЗадержка)); 
		
		РазностьЗадержки =  ТекСтрокаГрафика.Задержка-ЦелЗадержка;
		
		Если РазностьЗадержки < 0 Тогда //выпало за начало сценария
			
			ДатаНачала = ПолучитьСтрокуГрафикаПоЗадержке(0).ДатаНачала;
			ОшибкаРасчета = Ложь;
			ДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(ОшибкаРасчета);
			
			Возврат ДатаНачала;
			
		КонецЕсли;
		
		
		ТекСтрокаНачала = ПолучитьСтрокуГрафикаПоЗадержке(ТекСтрокаГрафика.Задержка-ЦелЗадержка);
		
		ДатаНачала = ТекСтрокаНачала.ДатаОкончания - ДробЗадержка*ТекСтрокаНачала.ДлительностьДня;
		
	ИначеЕсли Объект.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час") Тогда
		
		НадоДобавить = Объект.Длительность*3600;
		ТекДатаНачала = ТекДатаОкончания;
		ТекЗадержка = ТекСтрокаГрафика.Задержка;
		
		Пока Истина Цикл
			
			Если НадоДобавить = 0 Тогда
				Прервать;
			КонецЕсли;
			
			МожноДобавить = МИН(НадоДобавить,ТекДатаНачала -  ТекСтрокаГрафика.ДатаНачала);
			ТекДатаНачала = ТекДатаНачала - МожноДобавить;
			НадоДобавить = НадоДобавить - МожноДобавить;
			
			Если НадоДобавить > 0 Тогда
				
				ТекЗадержка = ТекЗадержка - 1;
				ТекСтрокаГрафика = ПолучитьСтрокуГрафикаПоЗадержке(ТекЗадержка);
				ТекДатаНачала = ТекСтрокаГрафика.ДатаОкончания;				
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДатаНачала = ТекДатаНачала;	
		
	КонецЕсли; 		
		
	Возврат ДатаНачала;	
	
КонецФункции

&НаКлиенте	
Функция ПосчитатьДатуОкончанияПоДатеНачала(ОшибкаРасчета,Направление = Истина)  Экспорт
	
	ТекДатаНачала = ДатаНачала;
	ТекСтрокаГрафика = ПолучитьСтрокуГрафика(ТекДатаНачала,Направление);	
	
	ЗадержкаНачалаДень = 0;
	ЗадержкаНачалаСек  = 0;
	
	Если НачалоДня(ДатаНачала) = ТекСтрокаГрафика.ДатаГрафика Тогда
		
		Разница =  (ДатаНачала-ТекСтрокаГрафика.ДатаНачала);
		
		Если ТекСтрокаГрафика.ЕстьПерерывы Тогда
			
			 Т_Пер = ТабПерерывы.НайтиСтроки(Новый Структура("ГрафикРаботы,НомерДня",Объект.ГрафикРаботы,ТекСтрокаГрафика.НомерДня)).Получить(0).ТабПерерывов;
							
				ДобавитьПер = 0;
							
				ВремяНачала = Дата(1,1,1)+(ДатаНачала-НачалоДня(ДатаНачала));
							
				Для Каждого СтрокаПер ИЗ Т_Пер Цикл
								
					Если ВремяНачала > СтрокаПер.ВремяНачала  Тогда
						//И ВремяНачала < СтрокаПер.ВремяОкончания Тогда
						ДобавитьПер = ДобавитьПер+(?(ВремяНачала >= СтрокаПер.ВремяОкончания,СтрокаПер.Длительность,СтрокаПер.ВремяОкончания-ВремяНачала));
					КонецЕсли;
								
				КонецЦикла;
							
			Разница = Разница-ДобавитьПер;
			
		КонецЕсли;

		ЗадержкаНачалаДень = Макс(0,Разница/ТекСтрокаГрафика.ДлительностьДня);
		
	Иначе
		
		ТекДатаНачала = ТекСтрокаГрафика.ДатаНачала;
		
	КонецЕсли; 		
	
	Если Объект.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День") Тогда
			
		ОбщЗадержка = Объект.Длительность+ЗадержкаНачалаДень;
		ЦелЗадержка = Цел(ОбщЗадержка);
		
		Если ЦелЗадержка = ОбщЗадержка Тогда
			ЦелЗадержка = ЦелЗадержка-1*(Объект.Длительность<>0);
		КонецЕсли;
		
		ДробЗадержка = ?(ОбщЗадержка-Цел(общЗадержка) = 0,1*(Объект.Длительность<>0),ОбщЗадержка-Цел(общЗадержка));
		
		ТекСтрокаОкончания = ПолучитьСтрокуГрафикаПоЗадержке(ТекСтрокаГрафика.Задержка+ЦелЗадержка);
		
		ДатаОкончания = ТекСтрокаОкончания.ДатаНачала+ДробЗадержка*ТекСтрокаОкончания.ДлительностьДня;
		
	ИначеЕсли Объект.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час") Тогда
		
		НадоДобавить = Объект.Длительность*3600;
		
		ТекЗадержка = ТекСтрокаГрафика.Задержка;
		ТекДатаОкончания = ТекДатаНачала;
				
		Пока Истина Цикл
			
			Если НадоДобавить = 0 Тогда
				Прервать;
			КонецЕсли;
			
			МожноДобавить = МИН(НадоДобавить,ТекСтрокаГрафика.ДатаОкончания - ТекДатаОкончания);
			
			ТекДатаОкончания = ТекДатаОкончания+МожноДобавить;
			
			НадоДобавить = НадоДобавить-МожноДобавить;
			
			Если НадоДобавить Тогда
				
				ТекЗадержка = ТекЗадержка+1;
				ТекСтрокаГрафика = ПолучитьСтрокуГрафикаПоЗадержке(ТекЗадержка);
				ТекДатаОкончания = ТекСтрокаГрафика.ДатаНачала;
				
			КонецЕсли;
						
		КонецЦикла;
		
		ДатаОкончания = ТекДатаОкончания; 	
		
	КонецЕсли; 	
	
	//Перерывы
	
	СтрокаОкончания = ПолучитьСтрокуГрафика(ДатаОкончания);
	
	Если СтрокаОкончания.ЕстьПерерывы Тогда
		
		Т_Пер  = ТабПерерывы.НайтиСтроки(Новый Структура("ГрафикРаботы,НомерДня",Объект.ГрафикРаботы,СтрокаОкончания.НомерДня)).Получить(0).ТабПерерывов;
		
		ВремяОкончания = Дата(1,1,1)+(ДатаОкончания-НачалоДня(ДатаОкончания));
		
		ВремяНачала = ?(НачалоДня(ДатаНачала) = НачалоДня(ДатаОкончания),Дата(1,1,1)+(ДатаНачала-НачалоДня(ДатаНачала)),Дата(1,1,1));
		
		Для Каждого СтрокаПер ИЗ Т_Пер Цикл 
			
			Если ВремяНачала > СтрокаПер.ВремяНачала Тогда
				Продолжить;
			КонецЕсли;  			
			
			Если ВремяОкончания > СтрокаПер.ВремяНачала Тогда
				Добавить = ?(ВремяОкончания >= СтрокаПер.ВремяОкончания,СтрокаПер.Длительность,СтрокаПер.ВремяОкончания-ВремяОкончания);
				ВремяОкончания = ВремяОкончания+Добавить;
				
			КонецЕсли;  			
			
		КонецЦикла;
		
		ДатаОкончания = НачалоДня(ДатаОкончания)+(ВремяОкончания-Дата(1,1,1));

		
		Если ВремяОкончания > СтрокаОкончания.ВремяОкончания Тогда
			
			Перенос = ВремяОкончания-СтрокаОкончания.ВремяОкончания;
			
			СтрокаОкончания = ПолучитьСтрокуГрафикаПоЗадержке(СтрокаОкончания.Задержка+1);
			
		    ДлительностьРасчета = ?(Объект.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час"),Перенос/3600,Перенос/СтрокаОкончания.ДлительностьДня);
			
			ДатаОкончания =  СтрокаОкончания.ДатаНачала+ДлительностьРасчета;
			
		//	ДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(ДлительностьРасчета,СтрокаОкончания.ДатаНачала,ОшибкаРасчета,ЕдиницаДлительности,Направление = Истина);
			
		КонецЕсли;  	
		
	КонецЕсли; 
 //Конец перерывы

	
	Возврат ДатаОкончания;       	
	
КонецФункции  

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент) 	
	
	СтрокаДаты = ПолучитьСТрокуГрафика(ДатаОкончания);
	
	Если СтрокаДаты.ДатаГрафика = НачалоДня(ДатаОкончания) Тогда
		
		Если ДатаОкончания = НачалоДня(ДатаОкончания) Тогда
			ДатаОкончания = СтрокаДаты.ДатаОкончания;
			
		Иначе 
			
			ДатаОкончания = Мин(ДатаОкончания,СтрокаДаты.ДатаОкончания);
			
			ДатаОкончания = Макс(ДатаОкончания,СтрокаДаты.ДатаНачала);
			
			Если ДатаОкончания = СтрокаДаты.ДатаНачала Тогда
				ДатаОкончания = СтрокаДаты.ДатаОкончания;
			КонецЕсли;
			
		КонецЕсли; 		
		
	Иначе
		
		ДатаОкончания = СтрокаДаты.ДатаОкончания;
		
	КонецЕсли;
	
	СохраненнаяДатаНачала = ДатаНачала;
	
	ДатаНачала = ПосчитатьДатуНачалаПоДатеОкончания();
	СтрокаДаты = ПолучитьСтрокуГрафика(ДатаНачала);
	Объект.Задержка = СтрокаДаты.Задержка+(ДатаНачала-СтрокаДаты.ДатаНачала)/СтрокаДаты.ДлительностьДня;
	
	ОшибкаРасчета = Ложь;
	РасчетнаяДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(ОшибкаРасчета);
	
	Если РасчетнаяДатаОкончания <> ДатаОкончания Тогда
		ДатаОкончания = РасчетнаяДатаОкончания;
	КонецЕсли;
	
	
	Модифицированность = Истина;
	
	РассчитатьТрудоМашиноемкость();  
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьПриИзменении(Элемент)
	
	Если Объект.Длительность = 0 Тогда
		
		Объект.Длительность = 1;
		
	КонецЕсли;
	
	ДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(Ложь);
	
	РассчитатьТрудоМашиноемкость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаДлительностиПриИзменении(Элемент)
	
	 ДлительностьПриИзменении(Элемент);
	
	РассчитатьТрудоМашиноемкость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДатаНачала = ПолучитьСтрокуГрафикаПоЗадержке(Объект.Задержка).ДатаНачала;
		ПосчитатьДатуОкончанияПоДатеНачала(Ложь);
		РассчитатьТрудоМашиноемкость();
		
	КонецЕсли;
	
	ТекДатаНачала = ДатаНачала;
	ТекДатаОкончания = ДатаОкончания;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ГрафикРаботы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьТаблицуГрафика();
	ПересчитатьДатыПриИзменииГрафика();
	РассчитатьТрудоМашиноемкость();
	
КонецПроцедуры

&НаКлиенте
Процедура  ПересчитатьДатыПриИзменииГрафика()
	
	СтрокаГрафика = ПолучитьСтрокуГрафика(ДатаНачала);
	
	Если НачалоДня(ДатаНачала) = СтрокаГрафика.ДатаГрафика Тогда 		
		
		ДатаНачала = СтрокаГрафика.ДатаНачала;
		
	КонецЕсли;
	
	Объект.Задержка = СтрокаГрафика.Задержка+(ДатаНачала-СтрокаГрафика.ДатаНачала)/СтрокаГрафика.ДлительностьДня;
	ДатаОкончания = ПосчитатьДатуОкончанияПоДатеНачала(Ложь);	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПредшественникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьТрудоМашиноемкость();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьВидимость();
	
	Строки = Объект.Материалы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Элемент.ТекущиеДанные.Номенклатура,Элемент.ТекущиеДанные.Характеристика));
	
	Если Строки.Количество()>1 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("МатериалыПриОкончанииРедактированияОтмена",ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения,"Данный материал уже учтен в работе",30);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура  МатериалыПриОкончанииРедактированияОтмена(Параметр1) Экспорт
	
	Объект.Материалы.Удалить(Объект.Материалы.Получить(Элементы.Материалы.ТекущиеДанные.НомерСтроки-1));
	
КонецПроцедуры  

&НаСервере
Процедура ПредшественникиСтроительнаяРаботаОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = НЕ ВыбранноеЗначение.СуммарнаяРабота И ВыбранноеЗначение <> Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиСтроительнаяРаботаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПредшественникиСтроительнаяРаботаОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.ТипЗависимости) Тогда
		
		ТекСтрока.ТипЗависимости = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.ЕдиницаЗадержки) Тогда
		
		ТекСтрока.ЕдиницаЗадержки = Объект.ЕдиницаДлительности;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	
	РассчитатьТрудоМашиноемкость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда 				
		
		Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("УправляемаяФорма") И 
			//Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") И //для совместимости > 8.3.13 
			
			ЭтотОбъект.ВладелецФормы.ИмяФормы = "Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаЭлементаДинамическая" Тогда
			
			Если ЭтоНовыйОбъект Тогда
				
				ЗаполнитьСтруктуруРаботыНаСервере(Истина);
				
			КонецЕсли;
			
			ЗаполнитьСтруктуруРаботыПослеНаСервере();
			
			Если ТипЗнч(СтруктураРаботы) = Тип("Структура") Тогда
				
				ЭтотОбъект.ВладелецФормы.ОбновитьДанныеПослеИзмененияРаботы(СтруктураРаботы,СтруктураРаботыПосле);
				
			КонецЕсли;
			
			ОповеститьОВыборе(Объект.Ссылка);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Родитель) И НЕ ТекущийОбъект.Родитель.СуммарнаяРабота Тогда
		
		ОбъектРодитель = ТекущийОбъект.Родитель.ПолучитьОбъект();
		ОбъектРодитель.СуммарнаяРабота = Истина;
		ОбъектРодитель.ОбменДанными.Загрузка = Истина;
		ОбъектРодитель.Записать();
		
	КонецЕсли;
	
	Если Переносить Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец",Объект.Владелец);
		Запрос.УстановитьПараметр("Работа",Объект.Родитель);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботыПредшественники.Ссылка,
		|	УСОERP_СтроительныеРаботыПредшественники.НомерСтроки
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы.Предшественники КАК УСОERP_СтроительныеРаботыПредшественники
		|ГДЕ
		|	УСОERP_СтроительныеРаботыПредшественники.Ссылка.Владелец = &Владелец
		|	И УСОERP_СтроительныеРаботыПредшественники.СтроительнаяРабота = &Работа";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Выб = Выборка.Ссылка.ПолучитьОбъект();
			Выб.ДополнительныеСвойства.Вставить("КопированиеСценария");
			Выб.Предшественники.Получить(Выборка.НомерСтроки-1).СтроительнаяРабота = Объект.Ссылка;
			Выб.ОбменДанными.Загрузка = Истина;
			Выб.Записать();			
			
		КонецЦикла; 	
		
	КонецЕсли;  	
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.Материалы,
	Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоУпаковокНаЕдиницуОбъемаПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.КоличествоУпаковокНаОбъемРаботы	= Окр(ТекущаяСтрока.КоличествоУпаковокНаЕдиницуОбъема * Объект.ОбъемРаботы, 3);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоУпаковокНаОбъемРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.КоличествоУпаковокНаЕдиницуОбъема	= ТекущаяСтрока.КоличествоУпаковокНаОбъемРаботы / Объект.ОбъемРаботы;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;

	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",       ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",    ТекущаяСтрока.Упаковка);

	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Материалы"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ОбъемРаботыПриИзменении(Элемент)
	
	Объект.ОбъемРаботы = Макс(Объект.ОбъемРаботы,ВыполненныйОбъем);
	
	Для Каждого СтрокаТЧ ИЗ Объект.Материалы Цикл
		СтрокаТЧ.КоличествоУпаковокНаОбъемРаботы = СтрокаТЧ.КоличествоУпаковокНаЕдиницуОбъема*Объект.ОбъемРаботы;
		СтрокаТЧ.КоличествоНаОбъемРаботы = СтрокаТЧ.КоличествоНаЕдиницуОбъема*Объект.ОбъемРаботы;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипОграниченияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОграничения) Тогда
		
		Если Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.НачалоНеРанее")
			ИЛИ  Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.НачалоНеПозднее")
			ИЛИ  Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.ФиксированноеНачало")
			
			Тогда Объект.ДатаОграничения = ДатаНачала;
			
		ИначеЕсли
			
			Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.ОкончаниеНеПозднее")
			ИЛИ  Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.ОкончаниеНеРанее")
			ИЛИ  Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.УСОERP_ТипыОграничений.ФиксированноеОкончание")
			Тогда Объект.ДатаОграничения = ДатаОкончания;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПометкаУдаления И ВыполненныйОбъем Тогда
		
		ПоказатьПредупреждение(,"По "+?(Объект.СуммарнаяРабота,"этапу ","работе ")+" было выполнение работ, удаление невозможно!");
		Отказ = Истина;
		
	Иначе		
		
		Если ЗначениеЗаполнено(Объект.Ссылка) И Модифицированность Тогда
			ЗаполнитьСтруктуруРаботыНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьНаЗаполненностьХарактеристик(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаЗаполненностьХарактеристик(Отказ)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТабТовары",Объект.Материалы.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботыМатериалы.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(УСОERP_СтроительныеРаботыМатериалы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	УСОERP_СтроительныеРаботыМатериалы.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТабТовары КАК УСОERP_СтроительныеРаботыМатериалы
	|ГДЕ
	|	УСОERP_СтроительныеРаботыМатериалы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|ГДЕ
	|	ВрТаб.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке № "+Выборка.НомерСтроки+" не заполнена характеристика",,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтруктуруРаботыНаСервере(ПометкаУдаления = Ложь) 
	
	Работа = Объект.Ссылка;
	
	Структура = Новый Структура;
	Структура.Вставить("Код",Работа.Код);
	Структура.Вставить("Наименование",Работа.Наименование);
	Структура.Вставить("Ссылка",Работа);
	Структура.Вставить("ПометкаУдаления",ПометкаУдаления);
	Структура.Вставить("Родитель",Работа.Родитель);
	
	Для Каждого Реквизит ИЗ Метаданные.Справочники.УСОERP_СтроительныеРаботы.Реквизиты Цикл
		Структура.Вставить(Реквизит.Имя,Работа[Реквизит.Имя]);
	КонецЦикла;
	
	Структура.Вставить("Материалы",Работа.Материалы.Выгрузить());
	Структура.Вставить("Ресурсы",Работа.Ресурсы.Выгрузить());
	Структура.Вставить("Предшественники",Работа.Предшественники.Выгрузить());
	
	СтруктураРаботы = Новый Структура("Ссылка,Структура",Работа,ЗначениеВСтрокуВнутр(Структура));	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтруктуруРаботыПослеНаСервере() 
	
	Работа = Объект.Ссылка;
	
	Структура = Новый Структура;
	Структура.Вставить("Код",Работа.Код);
	Структура.Вставить("Наименование",Работа.Наименование);
	Структура.Вставить("Ссылка",Работа);
	Структура.Вставить("ПометкаУдаления",Работа.ПометкаУдаления);
	Структура.Вставить("Родитель",Работа.Родитель);
	
	Для Каждого Реквизит ИЗ Метаданные.Справочники.УСОERP_СтроительныеРаботы.Реквизиты Цикл
		Структура.Вставить(Реквизит.Имя,Работа[Реквизит.Имя]);
	КонецЦикла;
	
	Структура.Вставить("Материалы",Работа.Материалы.Выгрузить());
	Структура.Вставить("Ресурсы",Работа.Ресурсы.Выгрузить());
	Структура.Вставить("Предшественники",Работа.Предшественники.Выгрузить());
	
	СтруктураРаботыПосле = Новый Структура("Ссылка,Структура",Работа,ЗначениеВСтрокуВнутр(Структура));	
	
КонецПроцедуры  

&НаКлиенте
Процедура РесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекСтрока = Элементы.Ресурсы.ТекущиеДанные;
		ТекСтрока.Количество = 1;
		ТекСтрока.ЗагрузкаПроцент = 100;
		ТекСтрока.ГрафикРаботы = Объект.ГрафикРаботы;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура МатериалыХарактеристикаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
